app/controllers/admin/categories_controller.rb

  def create
    @category = Category.new(category_params)
    if @category.save
      flash[:notice] = "category was successfully created"
      redirect_to admin_categories_path
    else
      @categories = Category.all
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "俄羅斯料理"], ["created_at", "2017-12-19 14:43:36.108107"], ["updated_at", "2017-12-19 14:43:36.108107"]]
SELECT "categories".* FROM "categories"

  def update
    if @category.update(category_params)
---
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "qqqqqq"], ["updated_at", "2017-12-21 08:00:38.526559"], ["id", 9]]