app/controllers/admin/restaurants_controller.rb

  def index
    @restaurants = Restaurant.page(params[:page]).per(10)
---
SELECT  "restaurants".* FROM "restaurants" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "restaurants"

  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "tel", "address", "opening_hours", "description", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @restaurant.update(restaurant_params)
---
UPDATE "restaurants" SET "category_id" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["category_id", 3], ["updated_at", "2017-12-19 13:43:16.213384"], ["id", 3005]]

  def destroy
    @restaurant.destroy
---
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 502]]

  def set_restaurant
    @restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 3005], ["LIMIT", 1]]