app/views/admin/restaurants/_form.html.erb

SELECT "categories".* FROM "categories"
---
      <div class="form-group">
        <%= f.collection_select :category_id, Category.all, :id, :name, {prompt: "select"}, {class: "form-control"} %>