app/views/restaurants/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."restaurant_id" = ?  [["restaurant_id", 2505]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <div class="row">
    <% @restaurant.comments.each do |comment| %>
      <div>
       <h4><%= comment.user.email.split("@").first %></h4>