app/controllers/comments_controller.rb

  def create
    @restaurant = Restaurant.find(params[:restaurant_id])
    @comment = @restaurant.comments.build(comment_params)
    @comment.user = current_user
    @comment.save!
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 2505], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "restaurant_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "sdklgjklsgjl"], ["restaurant_id", 2505], ["user_id", 1], ["created_at", "2018-01-07 07:33:53.168180"], ["updated_at", "2018-01-07 07:33:53.168180"]]

  def destroy
      @restaurant = Restaurant.find(params[:restaurant_id])
      @comment = Comment.find(params[:id])

      if current_user.admin?
        @comment.destroy
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 2505], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]