app/controllers/restaurants_controller.rb

SELECT  "restaurants".* FROM "restaurants" LIMIT ? OFFSET ?  [["LIMIT", 9], ["OFFSET", 0]]
SELECT COUNT(*) FROM "restaurants"
SELECT "categories".* FROM "categories"
---
  def index
    @restaurants = Restaurant.page(params[:page]).per(9)
    @categories = Category.all

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 2505], ["LIMIT", 1]]
---
  def show
    @restaurant = Restaurant.find(params[:id])